src/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочкиПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСДиалогами.УстановитьДоступностьЭлементовФормДокументаПоПравамПользователя(ЭтаФорма, Объект);
			
	// Установим реквизиты
	СкладДокумента = Объект.Склад;
	
	Если Не ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		Объект.ВидЦен = Справочники.ВидыЦен.Закупочная;
	КонецЕсли;  
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	// Сформируем надпись	
	Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен); 	
	ВидЦенНадпись = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи, Ложь);
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);	 
	СоздатьМенюУправленияТабличнымиЧастями();
	ОбновитьЗаголовкиТабЧастейНаСервере();
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.ЗаказПоставщику.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

КонецПроцедуры

&НаКлиенте
// Процедура, обработчит события ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования
	
	Объект.Запасы.Сортировать("Номенклатура");	
	Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи"
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСтоматология.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере"
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияСтоматология.ЗаполнитьПризнакИспользованияХарактеристик(Объект.Запасы);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" объект поле "Склад"
//
Процедура СкладПриИзменении(Элемент)
	
	СкладПередИзменением = СкладДокумента;
	СкладДокумента       = Объект.Склад;
	Если Объект.Склад <> СкладПередИзменением Тогда
		 УстановитьСтруктурнуюЕдиницуПоСкладу();		 
		 Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = объект.СтруктурнаяЕдиница;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Упаковка) Тогда	
		СтрокаТабличнойЧасти.Упаковка = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "УпаковкаПоумолчанию");	
	КонецЕсли;	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",  Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ДатаОбработки",	 	Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);
	СтруктураДанные.Вставить("Номенклатура", 		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Упаковка", 			СтрокаТабличнойЧасти.Упаковка);
	
	СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Упаковка = СтруктураДанные.Упаковка;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.КоличествоУпаковок) Тогда
		СтрокаТабличнойЧасти.КоличествоУпаковок = 1;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();	
	
	СтрокаТабличнойЧасти.ХарактеристикиИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "ИспользоватьПартии");
	ОбновитьЗаголовкиТабЧастейНаСервере();

	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"  поле ввода "Количество"
//
Процедура ЗапасыКоличествоУпаковокПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы["Запасы"].ТекущиеДанные;
	 
	ОбработкаТабличныхЧастейКлиент.ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(СтрокаТабличнойЧасти);
	 
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Упаковка"
//
Процедура ЗапасыУпаковкаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки",		Объект.Дата);
	СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
	СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииУпаковкиТабЧасти(СтрокаТабличнойЧасти, СтруктураДанные);
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
Процедура ЗапасыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.Запасы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Цена"
//
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "Сумма"
//
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПриИзмененииСуммыВТабличнойЧасти(СтрокаТабличнойЧасти);

	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поле ввода "СтавкаНДС".
//
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры 

&НаКлиенте
// Процедура, обработчик события "РедактироватьЦеныЗавершение"
//
Процедура РедактироватьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// 3. Перезаполняем табличную часть "Запасы" если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = Результат.ВидЦен;
		
		// Пересчитываем цены по виду цен.					
		Если Результат.ПерезаполнитьЦены Тогда
			ЦенообразованиеКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтаФорма, "Запасы");
		КонецЕсли;
		
	КонецЕсли;
	
	// Сформируем надпись
	СтруктураНадписи = Новый Структура("ВидЦен", Объект.ВидЦен); 	
	ВидЦенНадпись = СтроковыеФункцииКлиентСерверСтоматология.СформироватьНадписьЦеныИВалюта(СтруктураНадписи, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаНадписьНажатие(Элемент)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоПользователь", Истина);
    СтруктураПараметров.Вставить("Ссылка", ОбщегоНазначенияСтоматология.ДоступныеСтруктурныеЕдиницы()); 
	СтруктураПараметров.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияКомпоновкиДанных.ВСписке);
    ОткрытьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора", СтруктураПараметров,,,,,Новый ОписаниеОповещения("СтруктурнаяЕдиницаНадписьНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "СтруктурнаяЕдиницаНадписьНажатиеЗавершение"
//
Процедура СтруктурнаяЕдиницаНадписьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
	   Если Объект.СтруктурнаяЕдиница <> Результат Тогда
	     Объект.СтруктурнаяЕдиница = Результат;
	     Элементы.СтруктурнаяЕдиницаНадпись.Заголовок = Объект.СтруктурнаяЕдиница;
	     Объект.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
	   КонецЕсли;
   КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработатьНажатиеМеню(Элемент.Имя);
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает нажатие динамических кнопок.
//
Процедура ОбработатьНажатиеМеню(ИмяЭлемента)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, ИмяЭлемента);
			
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗапасыПриИзменении(Элемент)
	ОбновитьЗаголовкиТабЧастейНаСервере();
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте  
// Процедура, обработчик события ВидЦенНажатие
//
Процедура ВидЦенНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ЗапасыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		
		мПараметрыВыбора = Новый Структура;
		мПараметрыВыбора.Вставить("Владелец"                       , СтрокаТабличнойЧасти.Номенклатура);
		мПараметрыВыбора.Вставить("Склад"                          , Объект.Склад);
		мПараметрыВыбора.Вставить("СтруктурнаяЕдиница"             , Объект.СтруктурнаяЕдиница);
		мПараметрыВыбора.Вставить("Дата"                           , Объект.Дата);
        мПараметрыВыбора.Вставить("НеКонтролироватьОстаткиПоСкладу", Истина);
		мПараметрыВыбора.Вставить("МножественныйВыбор"             , Истина);

		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", мПараметрыВыбора,,,,,Новый ОписаниеОповещения("ЗапасыПартияНачалоВыбораЗавершение", ЭтотОбъект, СтрокаТабличнойЧасти), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗапасыПартияНачалоВыбораЗавершение"
//
Процедура ЗапасыПартияНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Параметры.Партия = Результат[0];
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ЗапасыПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиТабЧастейНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура оработчик команды "Подбор"
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти  = "Запасы";
	ЕстьПартии		   = Истина;
		
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",				   Объект.Дата);
	ПараметрыПодбора.Вставить("Склад",	   			   Объект.Склад);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",	   Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ВидЦен",	   			   Объект.ВидЦен);
	ПараметрыПодбора.Вставить("ИспользуетсяСодержание",Истина);

	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда
		АдресЗапасовВХранилище = ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии);
		ПараметрыПодбора.Вставить("АдресЗапасовДокумента", АдресЗапасовВХранилище);
	КонецЕсли; 
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры",	   ТипНоменклатуры);
		
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда			
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("СтатусПартии",	   		СтатусПартии);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ЕстьПартии", ЕстьПартии);

	ОткрытьФорму("ОбщаяФорма.ФормаПодбора",
	ПараметрыПодбора,,,,,
	Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора подбора
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПодборЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПолучитьЗапасыИзХранилища(РезультатВыбора, ДополнительныеПараметры.ИмяТабличнойЧасти, ДополнительныеПараметры.ЕстьПартии);
		ОбновитьЗаголовкиТабЧастейНаСервере();
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ЗагрузитьДанныеИзТСД", загружает данные из ТСД
//
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.ЗагрузитьДанныеИзТСД(УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;

	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ЗаказПоставщику");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды вызывает форму настройки и редактирования цен.
//
Процедура РедактироватьЦены(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидЦен", 	  			Объект.ВидЦен);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	Ложь);
	
	// 2. Открвыаем форму "Цены и Валюта".
	ОткрытьФорму("ОбщаяФорма.ФормаЦены", СтруктураПараметров,,,,,Новый ОписаниеОповещения("РедактироватьЦеныЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


// ==================================================МеханизмВнешнегоОборудования======================================================

&НаКлиенте
// МеханизмВнешнегоОборудования
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Запасы, ЭлементШтрихкода, , , Объект.Ссылка, Объект.Запасы, НеизвестныеШтрихкоды) Тогда
			ЗапасыНоменклатураПриИзменении(Элементы.Запасы.ТекущиеДанные);
			ЗапасыУпаковкаПриИзменении(Элементы.Запасы.ТекущиеДанные);		
		КонецЕсли;
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЦикла;							
	
КонецФункции // ПолученыШтрихкоды()

&НаКлиенте
// ПодключаемоеОборудование
// Процедура - обработчик команды командной панели табличной части.
//
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект, Новый Структура("ТекШтрихкод", ТекШтрихкод)), ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Поиск по штрихкоду завершение
//
// Параметры:
//  Значение				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПоискПоШтрихкодуЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Значение = Неопределено, ДополнительныеПараметры.ТекШтрихкод, Значение);
		
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		МассивШтрихкод = Новый Массив;
		МассивШтрихкод.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
		ПолученыШтрихкоды(МассивШтрихкод);
	КонецЕсли;

КонецПроцедуры

// ================================================Конец МеханизмВнешнегоОборудования==================================================

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

&НаКлиенте
// Процедура, обработчик команды "Импорт".
// 
Процедура Импорт(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ЗаказПоставщику.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

&НаСервере
// Процедура - Загрузить из файла на сервере.
//
// Параметры:
//  АдресЗагруженныхДанных	 - 	 - 
//
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		
		НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
				
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
			НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		Иначе
			НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Загрузить из файла завершение.
//
// Параметры:
//  АдресЗагруженныхДанных	 - 	 - 
//
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных)
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТаблицы);
	КонецЦикла;
	
	// ПересчитатьПлатежныйКалендарь();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Загрузка из файла запасы.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗагрузкаИзФайлаЗапасы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ЗаказПоставщику.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Загрузка данных из внешнего источника обработка результата.
//
// Параметры:
//  РезультатЗагрузки		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Обработать подготовленные данные.
//
// Параметры:
//  РезультатЗагрузки	 - 	 - 
//
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, "Номенклатура, Количество, СтавкаНДС");
				
				НоваяСтрока.Цена = СтрокаТаблицы.Цена;
				НоваяСтрока.КоличествоУпаковок = СтрокаТаблицы.Количество;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
					
					НоваяСтрока.СтавкаНДС = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.СтавкаНДС),
												НоваяСтрока.Номенклатура.СтавкаНДС, 
												ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СтавкаНДС);
					
				КонецЕсли;
				
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(НоваяСтрока);	
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(НоваяСтрока);
				ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(НоваяСтрока);	
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

#КонецОбласти

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.ЗаказПоставщику.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаСервере
// Процедура, устанавливает структурную единицу при изменении склада документа.
//  Параметры: 
//   Нет;
//
Процедура УстановитьСтруктурнуюЕдиницуПоСкладу()
	
	Объект.СтруктурнаяЕдиница = СкладДокумента.СтруктурнаяЕдиница;
	
КонецПроцедуры

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиент.РассчитатьСуммуВКолонкеВсегоТабЧасти(СтрокаТабличнойЧасти);	
	
 КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()
 
&НаСервере
// Функция получает список товаров из временного хранилища
//
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаЗагрузки.Номенклатура);
		СтруктураОтбора.Вставить("Упаковка", СтрокаЗагрузки.Упаковка);
		Если ЕстьПартии Тогда
			СтруктураОтбора.Вставить("Партия", СтрокаЗагрузки.Партия);
		КонецЕсли;
		
		Строки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			СтрокаТабличнойЧасти = Строки[0];
		Иначе
			СтрокаТабличнойЧасти = Объект[ИмяТабличнойЧасти].Добавить();
		КонецЕсли;
		
	    СтрокаТабличнойЧасти.Номенклатура =  СтрокаЗагрузки.Номенклатура;
		СтрокаТабличнойЧасти.Партия = СтрокаЗагрузки.Партия;
		СтрокаТабличнойЧасти.КоличествоУпаковок =  СтрокаЗагрузки.КоличествоУпаковок;
		СтрокаТабличнойЧасти.Количество = СтрокаЗагрузки.Количество;
		СтрокаТабличнойЧасти.Цена = СтрокаЗагрузки.Цена;
		СтрокаТабличнойЧасти.Упаковка = СтрокаЗагрузки.Упаковка;
		СтрокаТабличнойЧасти.СтавкаНДС = СтрокаЗагрузки.СтавкаНДС;
		
		СтрокаТабличнойЧасти.Сумма 		= СтрокаЗагрузки.Сумма;
		СтрокаТабличнойЧасти.СуммаНДС 	= СтрокаЗагрузки.СуммаНДС;
		СтрокаТабличнойЧасти.Всего 		= СтрокаЗагрузки.Всего;			
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
// Функция помещает список запасов во временное хранилище и возвращает адрес 
//
Функция ПоместитьЗапасыВХранилище(ИмяТабличнойЧасти, ЕстьПартии) 
	
	СписокКолонок = "Номенклатура, Количество, КоличествоУпаковок, Цена, Сумма, Всего, Упаковка, СтавкаНДС";
	Если ЕстьПартии Тогда
		СписокКолонок = СписокКолонок + ", Партия";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИмяТабличнойЧасти].Выгрузить(, СписокКолонок), УникальныйИдентификатор);
	
КонецФункции // ПоместитьЗапасыВХранилище()

&НаКлиенте
// Процедура, обработчик события ОбработкаОповещения
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ВнешнееОборудование 
	
	Если Источник = "ВнешнееОборудование" И ИмяСобытия = "НеизвестныеШтрихкоды" 
			И УникальныйИдентификатор = Параметр.ФормаВладелецУникальныйИдентификатор Тогда
		ПолученыШтрихкоды(Параметр.ЗарегистрированныеШтрихкоды);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура, создает меню управления табличными частями.
//
Процедура СоздатьМенюУправленияТабличнымиЧастями()
	
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("Запасы"        , "ГруппаЗапасы");
	СтруктураМеню.Вставить("Дополнительно" , "ГруппаДополнительно");
		
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет подсчет количества строк в таб.частях и выводит его в заголовок панели.
//
Процедура ОбновитьЗаголовкиТабЧастейНаСервере()
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции 

#КонецОбласти
